{"keras_version": "2.2.2", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 64, 64, 1]}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"data_format": "channels_last", "filters": 4, "bias_regularizer": null, "use_bias": true, "name": "conv2d_1", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "filters": 8, "bias_regularizer": null, "use_bias": true, "name": "conv2d_transpose_1", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "output_padding": null, "kernel_constraint": null}, "name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "filters": 1, "bias_regularizer": null, "use_bias": true, "name": "conv2d_2", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "filters": 1, "bias_regularizer": null, "use_bias": true, "name": "conv2d_3", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}], "output_layers": [["conv2d_3", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}