{"class_name": "Model", "keras_version": "2.2.2", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_6", "config": {"batch_input_shape": [null, 64, 64, 1], "name": "input_6", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "filters": 8, "name": "conv2d_15", "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_6", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "output_padding": null, "trainable": true, "filters": 8, "name": "conv2d_transpose_6", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_transpose_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "filters": 8, "name": "conv2d_16", "trainable": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "filters": 1, "name": "conv2d_17", "trainable": true, "activation": "sigmoid", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3]}}], "name": "model_6", "output_layers": [["conv2d_17", 0, 0]], "input_layers": [["input_6", 0, 0]]}}