{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["conv2d_9", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 64, 64, 1]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 16, "name": "conv2d_1", "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 16, "name": "conv2d_2", "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 16, "name": "conv2d_3", "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 16, "name": "conv2d_4", "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 16, "name": "conv2d_transpose_1", "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "strides": [2, 2], "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "output_padding": null}}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 16, "name": "conv2d_5", "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 16, "name": "conv2d_6", "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 16, "name": "conv2d_7", "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 16, "name": "conv2d_8", "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "filters": 1, "name": "conv2d_9", "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}], "input_layers": [["input_1", 0, 0]]}}