{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 64, 64, 1], "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "class_name": "Add", "name": "add_1"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_4", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "class_name": "Add", "name": "add_2"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2"}, {"config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "output_padding": null, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "activity_regularizer": null, "filters": 16, "name": "conv2d_transpose_1", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_5", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}, {"config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_6", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6"}, {"config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Add", "name": "add_3"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_7", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7"}, {"config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_8", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8"}, {"config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "class_name": "Add", "name": "add_4"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4"}, {"config": {"activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 1, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_9", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9"}], "output_layers": [["conv2d_9", 0, 0]], "name": "model_1"}, "class_name": "Model", "keras_version": "2.2.2"}