{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 64, 64, 1]}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "relu", "filters": 16, "data_format": "channels_last"}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "filters": 16, "data_format": "channels_last"}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "relu", "filters": 16, "data_format": "channels_last"}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "filters": 16, "data_format": "channels_last"}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_transpose_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "output_padding": null, "strides": [2, 2], "activation": "linear", "filters": 16, "data_format": "channels_last"}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "relu", "filters": 16, "data_format": "channels_last"}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "filters": 16, "data_format": "channels_last"}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "relu", "filters": 16, "data_format": "channels_last"}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "filters": 16, "data_format": "channels_last"}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "sigmoid", "filters": 1, "data_format": "channels_last"}}], "output_layers": [["conv2d_9", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.2"}