{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_25", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 64, 64, 1], "sparse": false, "dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_2", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_2"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "name": "add_1"}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_3", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_4", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_4"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}, "name": "add_2"}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_5", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_6", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_6"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}, "name": "add_3"}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "name": "activation_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_7", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_8", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_8"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}, "name": "add_4"}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "name": "activation_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_9", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_10", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_10"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}, "name": "add_5"}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "name": "activation_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_11", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_12", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_12"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["activation_5", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}, "name": "add_6"}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "name": "activation_6"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "strides": [2, 2], "trainable": true, "name": "conv2d_transpose_1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "output_padding": null, "filters": 32}, "name": "conv2d_transpose_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_13", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_13"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_14", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_14"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}, "name": "add_7"}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "name": "activation_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_15", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_16", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_16"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}, "name": "add_8"}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "name": "activation_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_17", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_18", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_18"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]], "config": {"name": "add_9", "trainable": true}, "name": "add_9"}, {"class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "name": "activation_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_19", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_19"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_20", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_20"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]], "config": {"name": "add_10", "trainable": true}, "name": "add_10"}, {"class_name": "Activation", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "name": "activation_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_21", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_21"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_22", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_22"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]], "config": {"name": "add_11", "trainable": true}, "name": "add_11"}, {"class_name": "Activation", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "name": "activation_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_23", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_23"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_24", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32}, "name": "conv2d_24"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["activation_11", 0, 0, {}]]], "config": {"name": "add_12", "trainable": true}, "name": "add_12"}, {"class_name": "Activation", "inbound_nodes": [[["add_12", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "name": "activation_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_size": [5, 5], "strides": [1, 1], "trainable": true, "name": "conv2d_25", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 1}, "name": "conv2d_25"}]}, "keras_version": "2.2.2"}