{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["conv2d_25", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_1", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_3", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_4", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_5", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_6", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_7", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_8", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_9", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_9"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_10", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_10"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_11", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_11"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_12", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_12"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}], ["activation_5", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_transpose_1", "data_format": "channels_last", "kernel_regularizer": null, "strides": [2, 2], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "output_padding": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_transpose_1"}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_13", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_13"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_14", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_14"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_15", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_15"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_16", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_16"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "name": "add_8"}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_17", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_17"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_18", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_18"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "name": "add_9"}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_19", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_19"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_20", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_20"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_10"}, "name": "add_10"}, {"inbound_nodes": [[["add_10", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_21", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_21"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_22", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_22"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_11"}, "name": "add_11"}, {"inbound_nodes": [[["add_11", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "name": "activation_11"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_23", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_23"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_24", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_24"}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}], ["activation_11", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_12"}, "name": "add_12"}, {"inbound_nodes": [[["add_12", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12"}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "conv2d_25", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same"}, "name": "conv2d_25"}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.2"}