{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 1], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_1", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2"}}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_2", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_5", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "conv2d_6", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3"}}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_3", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_7", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4"}}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_4", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_9", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5"}}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_5", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_11", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "conv2d_12", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["activation_5", 0, 0, {}]]], "name": "add_6", "config": {"trainable": true, "name": "add_6"}}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_6", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_transpose_1", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_transpose_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "output_padding": null, "kernel_constraint": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_13", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "conv2d_14", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "name": "add_7", "config": {"trainable": true, "name": "add_7"}}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_7", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_15", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "conv2d_16", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]], "name": "add_8", "config": {"trainable": true, "name": "add_8"}}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_8", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_17", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]], "name": "add_9", "config": {"trainable": true, "name": "add_9"}}, {"class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_9", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_19", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "conv2d_20", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]], "name": "add_10", "config": {"trainable": true, "name": "add_10"}}, {"class_name": "Activation", "inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "activation_10", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_21", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_21", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "conv2d_22", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_22", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]], "name": "add_11", "config": {"trainable": true, "name": "add_11"}}, {"class_name": "Activation", "inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "activation_11", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_23", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_23", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "conv2d_24", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_24", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 32}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["activation_11", 0, 0, {}]]], "name": "add_12", "config": {"trainable": true, "name": "add_12"}}, {"class_name": "Activation", "inbound_nodes": [[["add_12", 0, 0, {}]]], "name": "activation_12", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_25", "config": {"padding": "same", "data_format": "channels_last", "name": "conv2d_25", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "filters": 1}}], "output_layers": [["conv2d_25", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}