{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_1", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_2", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_3", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_4", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}], ["add_1", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv2d_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_5", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "leaky_re_lu_5", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_6", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_6", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}], ["add_2", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv2d_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_7", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "leaky_re_lu_7", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_8", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "leaky_re_lu_8", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}], ["add_3", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "conv2d_9", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_9", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "leaky_re_lu_9", "config": {"trainable": true, "name": "leaky_re_lu_9", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_10", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "leaky_re_lu_10", "config": {"trainable": true, "name": "leaky_re_lu_10", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}], ["add_4", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5"}}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "conv2d_transpose_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "output_padding": null, "trainable": true, "filters": 32, "bias_regularizer": null, "name": "conv2d_transpose_1", "strides": [2, 2], "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_11", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_11", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "leaky_re_lu_11", "config": {"trainable": true, "name": "leaky_re_lu_11", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "conv2d_12", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_12", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "leaky_re_lu_12", "config": {"trainable": true, "name": "leaky_re_lu_12", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "name": "add_6", "config": {"trainable": true, "name": "add_6"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "conv2d_13", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_13", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "leaky_re_lu_13", "config": {"trainable": true, "name": "leaky_re_lu_13", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "conv2d_14", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_14", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "leaky_re_lu_14", "config": {"trainable": true, "name": "leaky_re_lu_14", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}], ["add_6", 0, 0, {}]]], "name": "add_7", "config": {"trainable": true, "name": "add_7"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "conv2d_15", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_15", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "leaky_re_lu_15", "config": {"trainable": true, "name": "leaky_re_lu_15", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "name": "conv2d_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_16", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "leaky_re_lu_16", "config": {"trainable": true, "name": "leaky_re_lu_16", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}], ["add_7", 0, 0, {}]]], "name": "add_8", "config": {"trainable": true, "name": "add_8"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "conv2d_17", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_17", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "leaky_re_lu_17", "config": {"trainable": true, "name": "leaky_re_lu_17", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_18", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "leaky_re_lu_18", "config": {"trainable": true, "name": "leaky_re_lu_18", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}], ["add_8", 0, 0, {}]]], "name": "add_9", "config": {"trainable": true, "name": "add_9"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "conv2d_19", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_19", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "leaky_re_lu_19", "config": {"trainable": true, "name": "leaky_re_lu_19", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]], "name": "conv2d_20", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_20", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "leaky_re_lu_20", "config": {"trainable": true, "name": "leaky_re_lu_20", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}], ["add_9", 0, 0, {}]]], "name": "add_10", "config": {"trainable": true, "name": "add_10"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "conv2d_21", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_21", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "leaky_re_lu_21", "config": {"trainable": true, "name": "leaky_re_lu_21", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]], "name": "conv2d_22", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "name": "conv2d_22", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "leaky_re_lu_22", "config": {"trainable": true, "name": "leaky_re_lu_22", "alpha": 0.10000000149011612}}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}], ["add_10", 0, 0, {}]]], "name": "add_11", "config": {"trainable": true, "name": "add_11"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "conv2d_23", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "hard_sigmoid", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 1, "name": "conv2d_23", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}}], "output_layers": [["conv2d_23", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}