{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 1], "sparse": false, "name": "input_1", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_1", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_2", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_3", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_4", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_5", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_6", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_7", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_8", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_9", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_10", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_11", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_12", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["activation_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"use_bias": true, "data_format": "channels_last", "activation": "linear", "trainable": true, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "output_padding": null, "kernel_size": [5, 5], "name": "conv2d_transpose_1", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_13", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_14", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_15", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_16", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_17", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_18", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_19", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_20", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_10", "config": {"trainable": true, "name": "add_10"}, "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_21", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_22", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_11", "config": {"trainable": true, "name": "add_11"}, "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_23", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"trainable": true, "data_format": "channels_last", "activation": "linear", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_24", "filters": 32, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_12", "config": {"trainable": true, "name": "add_12"}, "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["activation_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"trainable": true, "data_format": "channels_last", "activation": "sigmoid", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "name": "conv2d_25", "filters": 1, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["conv2d_25", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.2"}