{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 64, 64, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_12", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["activation_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "output_padding": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_transpose_1", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_13", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_14", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_15", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_16", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_17", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_18", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_19", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_20", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_10", "config": {"name": "add_10", "trainable": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_21", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_22", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_11", "config": {"name": "add_11", "trainable": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_23", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_24", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_12", "config": {"name": "add_12", "trainable": true}, "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["activation_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 1, "trainable": true, "padding": "same", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_25", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}], "output_layers": [["conv2d_25", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.2"}