{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 64, 64, 1], "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_6", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_7", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_8", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_9", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_10", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_11", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_12", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["activation_5", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"padding": "same", "trainable": true, "filters": 32, "output_padding": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [2, 2], "bias_constraint": null, "name": "conv2d_transpose_1", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_13", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_14", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_15", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_16", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_17", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_18", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_19", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_20", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"name": "add_10", "trainable": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_21", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_22", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "add_11", "class_name": "Add", "config": {"name": "add_11", "trainable": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_23", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_24", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "add_12", "class_name": "Add", "config": {"name": "add_12", "trainable": true}, "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["activation_11", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "filters": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_25", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_25", 0, 0]]}}