{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["conv2d_25", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_3", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_4", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_5", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_6", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_7", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_8", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4"}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_9", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_10", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_5", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"trainable": true, "name": "add_5"}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_11", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_12", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_6", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["activation_5", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6"}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "output_padding": null, "strides": [2, 2], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_transpose_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_13", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_14", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_7", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_7"}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_15", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_16", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_8", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"trainable": true, "name": "add_8"}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_17", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_18", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_9", "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]], "config": {"trainable": true, "name": "add_9"}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_19", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_20", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Add", "name": "add_10", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]], "config": {"trainable": true, "name": "add_10"}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_21", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_22", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "Add", "name": "add_11", "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]], "config": {"trainable": true, "name": "add_11"}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_23", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_24", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "Add", "name": "add_12", "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["activation_11", 0, 0, {}]]], "config": {"trainable": true, "name": "add_12"}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["add_12", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 1, "name": "conv2d_25", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "data_format": "channels_last", "kernel_size": [3, 3]}}]}, "keras_version": "2.2.2"}