{"backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 64, 64, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_6", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_7", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_8", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_9", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_10", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_11", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_12", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["activation_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "trainable": true, "activation": "linear", "bias_regularizer": null, "name": "conv2d_transpose_1", "bias_constraint": null, "activity_regularizer": null, "output_padding": null, "kernel_regularizer": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_13", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_14", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_15", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_16", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_17", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_18", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_19", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_20", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5]}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_10", "config": {"name": "add_10", "trainable": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_21", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_22", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_11", "config": {"name": "add_11", "trainable": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "relu", "bias_regularizer": null, "name": "conv2d_23", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_24", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_12", "config": {"name": "add_12", "trainable": true}, "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["activation_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "activation": "sigmoid", "bias_regularizer": null, "name": "conv2d_25", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_25", 0, 0]]}, "keras_version": "2.2.2", "class_name": "Model"}