{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 1]}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_5", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [2, 2], "kernel_constraint": null, "output_padding": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_transpose_1", "activation": "linear", "trainable": true, "filters": 32, "padding": "same"}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_12", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_6", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_13", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_14", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_7", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["activation_6", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_15", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_16", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_8", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_17", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_18", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_9", "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]], "config": {"name": "add_9", "trainable": true}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_19", "padding": "same", "activation": "relu", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_20", "padding": "same", "activation": "linear", "trainable": true, "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Add", "name": "add_10", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]], "config": {"name": "add_10", "trainable": true}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_21", "padding": "same", "activation": "sigmoid", "trainable": true, "filters": 1, "dilation_rate": [1, 1]}}], "output_layers": [["conv2d_21", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}