{"keras_version": "2.2.2", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 64, 64, 1]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_1", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_2", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"trainable": true, "name": "add_1"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_3", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_4", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"trainable": true, "name": "add_2"}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_5", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_6", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"trainable": true, "name": "add_3"}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "output_padding": null, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_transpose_1", "strides": [2, 2], "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_7", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_8", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"trainable": true, "name": "add_4"}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_9", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_10", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "add_5", "class_name": "Add", "config": {"trainable": true, "name": "add_5"}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_11", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_12", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}], ["activation_5", 0, 0, {}]]], "name": "add_6", "class_name": "Add", "config": {"trainable": true, "name": "add_6"}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "name": "conv2d_13", "strides": [1, 1], "activation": "sigmoid", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 1}}], "output_layers": [["conv2d_13", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}