{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["conv2d_4", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 64, 64, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "conv2d_1", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "filters": 4, "activation": "linear"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "conv2d_2", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "filters": 8, "activation": "linear"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "conv2d_3", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "filters": 16, "activation": "linear"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "conv2d_4", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "filters": 1, "activation": "linear"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.2"}