{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 64, 64, 1], "dtype": "float32"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"output_padding": null, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_transpose_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["activation_6", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_16", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_9", "class_name": "Add", "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]], "config": {"name": "add_9", "trainable": true}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"name": "conv2d_19", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "conv2d_20", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"name": "add_10", "class_name": "Add", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]], "config": {"name": "add_10", "trainable": true}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"name": "conv2d_21", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "filters": 1, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_21", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_21", 0, 0]]}}