{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "name": "input_2"}, "name": "input_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 8, "use_bias": true, "name": "conv2d_6", "kernel_size": [3, 3]}, "name": "conv2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "linear", "padding": "same", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 8, "use_bias": true, "name": "conv2d_7", "kernel_size": [3, 3]}, "name": "conv2d_7"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["input_2", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}, "name": "add_3"}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"trainable": true, "activation": "sigmoid", "name": "activation_3"}, "name": "activation_3"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "padding": "same", "output_padding": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "filters": 8, "use_bias": true, "name": "conv2d_transpose_2", "kernel_size": [3, 3]}, "name": "conv2d_transpose_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "relu", "padding": "same", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 8, "use_bias": true, "name": "conv2d_8", "kernel_size": [3, 3]}, "name": "conv2d_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "linear", "padding": "same", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 8, "use_bias": true, "name": "conv2d_9", "kernel_size": [3, 3]}, "name": "conv2d_9"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["conv2d_transpose_2", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4"}, "name": "add_4"}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"trainable": true, "activation": "sigmoid", "name": "activation_4"}, "name": "activation_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "sigmoid", "padding": "same", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 1, "use_bias": true, "name": "conv2d_10", "kernel_size": [3, 3]}, "name": "conv2d_10"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["conv2d_10", 0, 0]], "name": "model_2"}, "keras_version": "2.2.2"}