{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 64, 64, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_1", "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_2", "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "strides": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "add_1", "config": {"name": "add_1", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_transpose_1", "config": {"bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_transpose_1", "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "strides": [2, 2], "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "trainable": true, "output_padding": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_3", "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_4", "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "strides": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "name": "add_2", "config": {"name": "add_2", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_5", "config": {"bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_5", "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "strides": [1, 1], "activity_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "trainable": true}}], "name": "model_1", "output_layers": [["conv2d_5", 0, 0]], "input_layers": [["input_1", 0, 0]]}}