{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_23", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_1", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_2", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_3", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_3", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_4", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_5", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_5", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_6", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_6", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_7", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_7", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_8", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_9", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_9", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_10", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_10", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "same", "activation": "linear", "output_padding": null, "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_transpose_1", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_transpose_1", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_11", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_11", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_12", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_12", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "name": "activation_6", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_13", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_13", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_14", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_14", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_7"}, "name": "add_7", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "name": "activation_7", "inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_15", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_15", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_16", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_16", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_8"}, "name": "add_8", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8", "inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_17", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_17", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_18", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_18", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_9"}, "name": "add_9", "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9", "inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_19", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_19", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_20", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_20", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_10"}, "name": "add_10", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10", "inbound_nodes": [[["add_10", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_21", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_21", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_22", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_22", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "add_11"}, "name": "add_11", "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11", "inbound_nodes": [[["add_11", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "same", "activation": "sigmoid", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_23", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 1, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "name": "conv2d_23", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model_1"}, "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Model"}