{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 64, 64, 1], "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_1", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_2", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true}, "name": "add_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_3", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_3", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_4", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true}, "name": "add_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_5", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_5", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_6", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_6", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true}, "name": "add_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_7", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_7", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_8", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true}, "name": "add_4", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_9", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_9", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_10", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_10", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true}, "name": "add_5", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "output_padding": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_transpose_1", "strides": [2, 2], "filters": 32}, "name": "conv2d_transpose_1", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_11", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_11", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_12", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_12", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true}, "name": "add_6", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_13", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_13", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_14", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_14", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true}, "name": "add_7", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_15", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_15", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_16", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_16", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true}, "name": "add_8", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_17", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_17", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_18", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_18", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_9", "trainable": true}, "name": "add_9", "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_19", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_19", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_20", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_20", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_10", "trainable": true}, "name": "add_10", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["activation_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_21", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_21", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_22", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_22", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_11", "trainable": true}, "name": "add_11", "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["activation_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 1, "name": "conv2d_23", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_23", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["conv2d_23", 0, 0]]}, "keras_version": "2.2.2"}